app/controllers/raiders_controller.rb

SELECT "raiders".* FROM "raiders"
---
  def index
    @raiders = Raider.all

SELECT "raiders".* FROM "raiders" WHERE "raiders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @raider = Raider.find(params[:id])

INSERT INTO "raiders" ("name", "active_ind", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Kelaman"], ["active_ind", 1], ["created_at", "2022-01-26 23:06:03.381800"], ["updated_at", "2022-01-26 23:06:03.381800"]]
---
  def create
    @raider = Raider.new(raider_params)

    if @raider.save

SELECT "raiders".* FROM "raiders" WHERE "raiders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @raider = Raider.find(params[:id])

SELECT "raiders".* FROM "raiders" WHERE "raiders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "raiders" SET "active_ind" = ?, "updated_at" = ? WHERE "raiders"."id" = ?  [["active_ind", 0], ["updated_at", "2022-01-27 00:09:40.423221"], ["id", 1]]
---
  def update
    @raider = Raider.find(params[:id])

    if @raider.update(raider_params)

SELECT "raiders".* FROM "raiders" WHERE "raiders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "raiders" WHERE "raiders"."id" = ?  [["id", 2]]
---
  def destroy
    @raider = Raider.find(params[:id])
    @raider.destroy